I think I found a case when VPC endpoints are regenerated: it is a change of dependency for a module combined with the change of tags (maybe even any value of endpoint), i.e.:

```diff
diff --git a/examples/complete-vpc/main.tf b/examples/complete-vpc/main.tf
index 7bede5b..6ba2c6b 100644
--- a/examples/complete-vpc/main.tf
+++ b/examples/complete-vpc/main.tf
@@ -10,6 +10,7 @@ locals {
     Example    = local.name
     GithubRepo = "terraform-aws-vpc"
     GithubOrg  = "terraform-aws-modules"
+    NewTag     = "value"
   }
 }
 
@@ -176,6 +177,10 @@ module "vpc_endpoints" {
     Project  = "Secret"
     Endpoint = "true"
   })
+
+  depends_on = [
+    data.aws_security_group.default,
+  ]
 }
 
 module "vpc_endpoints_nocreate" {
```

Then `terraform plan` shows:

```
...
  # module.vpc_endpoints.data.aws_vpc_endpoint_service.this["codedeploy_commands_secure"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_vpc_endpoint_service" "this" {
      + acceptance_required           = (known after apply)
      + arn                           = (known after apply)
...
    }

  # module.vpc_endpoints.aws_vpc_endpoint.this["codedeploy"] must be replaced
-/+ resource "aws_vpc_endpoint" "this" {
      ~ arn                   = "arn:aws:ec2:eu-west-1:123456789012:vpc-endpoint/vpce-0c2dfa7003bdf5354" -> (known after apply)
...
      ~ service_name          = "com.amazonaws.eu-west-1.codedeploy" -> (known after apply) # forces replacement
...
    }
...
Plan: 13 to add, 39 to change, 13 to destroy.
```

After the patch:

```diff
diff --git a/examples/complete-vpc/main.tf b/examples/complete-vpc/main.tf
index c298597..20da5fb 100644
--- a/examples/complete-vpc/main.tf
+++ b/examples/complete-vpc/main.tf
@@ -10,6 +10,7 @@ locals {
     Example    = local.name
     GithubRepo = "terraform-aws-vpc"
     GithubOrg  = "terraform-aws-modules"
+    NewTag     = "value"
   }
 }
 
@@ -94,8 +95,9 @@ module "vpc_endpoints" {
 
   endpoints = {
     s3 = {
-      service = "s3"
-      tags    = { Name = "s3-vpc-endpoint" }
+      service      = "s3"
+      service_name = "com.amazonaws.${local.region}.s3"
+      tags         = { Name = "s3-vpc-endpoint" }
     },
     dynamodb = {
       service         = "dynamodb"
@@ -107,67 +109,79 @@ module "vpc_endpoints" {
     },
     ssm = {
       service             = "ssm"
+      service_name        = "com.amazonaws.${local.region}.ssm"
       private_dns_enabled = true
       subnet_ids          = module.vpc.private_subnets
       security_group_ids  = [aws_security_group.vpc_tls.id]
     },
     ssmmessages = {
       service             = "ssmmessages"
+      service_name        = "com.amazonaws.${local.region}.ssmmessages"
       private_dns_enabled = true
       subnet_ids          = module.vpc.private_subnets
     },
     lambda = {
       service             = "lambda"
+      service_name        = "com.amazonaws.${local.region}.lambda"
       private_dns_enabled = true
       subnet_ids          = module.vpc.private_subnets
     },
     ecs = {
       service             = "ecs"
+      service_name        = "com.amazonaws.${local.region}.ecs"
       private_dns_enabled = true
       subnet_ids          = module.vpc.private_subnets
     },
     ecs_telemetry = {
       create              = false
       service             = "ecs-telemetry"
+      service_name        = "com.amazonaws.${local.region}.ecs-telemetry"
       private_dns_enabled = true
       subnet_ids          = module.vpc.private_subnets
     },
     ec2 = {
       service             = "ec2"
+      service_name        = "com.amazonaws.${local.region}.ec2"
       private_dns_enabled = true
       subnet_ids          = module.vpc.private_subnets
       security_group_ids  = [aws_security_group.vpc_tls.id]
     },
     ec2messages = {
       service             = "ec2messages"
+      service_name        = "com.amazonaws.${local.region}.ec2messages"
       private_dns_enabled = true
       subnet_ids          = module.vpc.private_subnets
     },
     ecr_api = {
       service             = "ecr.api"
+      service_name        = "com.amazonaws.${local.region}.ecr.api"
       private_dns_enabled = true
       subnet_ids          = module.vpc.private_subnets
       policy              = data.aws_iam_policy_document.generic_endpoint_policy.json
     },
     ecr_dkr = {
       service             = "ecr.dkr"
+      service_name        = "com.amazonaws.${local.region}.ecr.dkr"
       private_dns_enabled = true
       subnet_ids          = module.vpc.private_subnets
       policy              = data.aws_iam_policy_document.generic_endpoint_policy.json
     },
     kms = {
       service             = "kms"
+      service_name        = "com.amazonaws.${local.region}.kms"
       private_dns_enabled = true
       subnet_ids          = module.vpc.private_subnets
       security_group_ids  = [aws_security_group.vpc_tls.id]
     },
     codedeploy = {
       service             = "codedeploy"
+      service_name        = "com.amazonaws.${local.region}.codedeploy"
       private_dns_enabled = true
       subnet_ids          = module.vpc.private_subnets
     },
     codedeploy_commands_secure = {
       service             = "codedeploy-commands-secure"
+      service_name        = "com.amazonaws.${local.region}.codedeploy-commands-secure"
       private_dns_enabled = true
       subnet_ids          = module.vpc.private_subnets
     },
@@ -177,6 +191,10 @@ module "vpc_endpoints" {
     Project  = "Secret"
     Endpoint = "true"
   })
+
+  depends_on = [
+    data.aws_security_group.default,
+  ]
 }
 
 module "vpc_endpoints_nocreate" {
```

and PR#859 result is:

```
Plan: 0 to add, 52 to change, 0 to destroy.
```

Only changes!
